NextFOAM-2501/tutorials/incompressible/pimpleFoam/LES/periodicHill/steadyState/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-3 0 0);

boundaryField
{
    "(inlet|outlet|front|back)"
    {
        type            cyclic;
    }

    "(top|hills)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
